In [ ]:
import pandas as pd

In [1]:
pip install pandas

Requirement already satisfied: pandas in ./venv/lib/python3.12/site-packages (2.3.0)
Requirement already satisfied: numpy>=1.26.0 in ./venv/lib/python3.12/site-packages (from pandas) (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in ./venv/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./venv/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./venv/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

# Create a simple DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]
}
df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [4]:
df.head()

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [5]:
df[df['Age'] > 28]

      Name  Age
1      Bob   30
2  Charlie   35

In [7]:
df[df['Name']== 'Bob']

  Name  Age
1  Bob   30

In [8]:
df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [9]:
df.filter(['Name'])

      Name
0    Alice
1      Bob
2  Charlie

In [10]:
df.filter(['age'])

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [13]:
 df[df['Age'] > 30]

      Name  Age
2  Charlie   35

In [14]:
import pandas

mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pandas.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [16]:


mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2